# This is my brewfile, there are many like it but this one is mine
# https://github.com/Homebrew/homebrew-bundle

# Config and some casks
cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/drivers"

# Command-line tools
brew "coreutils"
brew "git"
brew "bash-completion"
brew "vim"
brew "jq"
brew "pwgen"
brew "python3"
brew "awscli"
brew "vice"

# Apps, gotta have apps man
cask "google-chrome"
cask "dropbox"
cask "iterm2"
cask "sublime-text"
cask "virtualbox"
cask "spotify"
cask "skitch"
cask "etcher"
cask "bose-updater"
cask "charles"
cask "firefox"
cask "cakebrew"
cask "mp4tools"
cask "discord"
cask "jetbrains-toolbox"
cask "versions"
cask "caskroom/versions/java8"

# Mac AppStore apps because MORE APPS
mas "1Password", id: 443987910
mas "Kaleidoscope", id: 587512244
mas "Kindle", id: 405399194
mas "Bear", id: 1091189122
mas "Moom", id: 419330170
mas "Pixelmator", id: 407963104
mas "DaisyDisk", id: 411643860

# Javaaahhhhhhh
cask "java"
brew "maven"
brew "jenv"

