# This is my brewfile, there are many like it but this one is mine
# https://github.com/Homebrew/homebrew-bundle

# Config and some casks
cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/drivers"

# Command-line tools
brew "coreutils"
brew "telnet"
brew "wget"
brew "git"
brew "bash-completion"
brew "vim"
brew "jq"
brew "pwgen"
brew "python3"
brew "awscli"
brew "bash-git-prompt"
brew "npm"
brew "yarn"
brew "nvm"

# Apps, gotta have apps man
cask "dropbox"
cask "iterm2"
cask "sublime-text"
cask "skitch"
cask "etcher"
